Tekla Open API Reference for Tekla Structures 2025
DateTimeConstantFilterExpression Constructor
Overload List
Name | Description
DateTimeConstantFilterExpression(IEnumerable<DateTime>)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
DateTimeConstantFilterExpression(DateTime)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
DateTimeConstantFilterExpression(IEnumerable<DateTime>, IFormatProvider)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
DateTimeConstantFilterExpression(DateTime, IFormatProvider)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
Top
See Also
Reference
DateTimeConstantFilterExpression Class
Tekla.Structures.Filtering Namespace